Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no"?><edc:PIC xmlns:edc="http://crownking/edc" xmlns:atdf="http://crownking/atdf" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" atdf:architecture="CORTEX-M4" atdf:family="PIC32CX" edc:arch="arm32bit" edc:hasfreeze="false" edc:masksetid="SG003" edc:name="PIC32CX1012BZ25048" edc:procid="0x0000" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:maxvoltage="3.60" edc:minvoltage="1.90" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true"/>
  <edc:ArchDef edc:desc="arm32bit" edc:name="arm32bit">
    <edc:MemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFFFFFFFF" edc:wordinit="0xFFFFFFFF" edc:wordsafe="0xFFFFFFFF" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="armv7m"/>
  <edc:InterruptList>
    <edc:Interrupt edc:cname="Reset" edc:desc="Reset Vector, invoked on Power up and warm reset" edc:irq="-15"/>
    <edc:Interrupt edc:cname="NonMaskableInt" edc:desc="Non maskable Interrupt, cannot be stopped or preempted" edc:irq="-14"/>
    <edc:Interrupt edc:cname="HardFault" edc:desc="Hard Fault, all classes of Fault" edc:irq="-13"/>
    <edc:Interrupt edc:cname="MemoryManagement" edc:desc="Memory Management, MPU mismatch, including Access Violation and No Match" edc:irq="-12"/>
    <edc:Interrupt edc:cname="BusFault" edc:desc="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault" edc:irq="-11"/>
    <edc:Interrupt edc:cname="UsageFault" edc:desc="Usage Fault, i.e. Undef Instruction, Illegal State Transition" edc:irq="-10"/>
    <edc:Interrupt edc:cname="SVCall" edc:desc="System Service Call via SVC instruction" edc:irq="-5"/>
    <edc:Interrupt edc:cname="DebugMonitor" edc:desc="Debug Monitor" edc:irq="-4"/>
    <edc:Interrupt edc:cname="PendSV" edc:desc="Pendable request for system service" edc:irq="-2"/>
    <edc:Interrupt edc:cname="SysTick" edc:desc="System Tick Timer" edc:irq="-1"/>
    <edc:Interrupt edc:cname="RTC" edc:desc="Real Time Counter" edc:irq="0" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:cname="EIC" edc:desc="External Interrupt Controller" edc:irq="1" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="FREQM" edc:desc="Frequency Meter" edc:irq="2" ltx:memberofperipheral="FREQM"/>
    <edc:Interrupt edc:cname="FLASH_CONTROL" edc:desc="Non-Volatile Memory" edc:irq="3" ltx:memberofperipheral="NVM"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_A" edc:desc="PORT_A_INPUT_CHANGE_INTERRUPT" edc:irq="4" ltx:memberofperipheral="GPIOA"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_B" edc:desc="PORT_B_INPUT_CHANGE_INTERRUPT" edc:irq="5" ltx:memberofperipheral="GPIOB"/>
    <edc:Interrupt edc:cname="DMAC_0_3" edc:desc="DMA Channel 0..3" edc:irq="6" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:cname="DMAC_4_15" edc:desc="DMA Channel 4..X" edc:irq="7" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:cname="EVSYS_0_3" edc:desc="Event System Channel 0..3" edc:irq="8" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="EVSYS_4_11" edc:desc="Event System Channel 4..X" edc:irq="9" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="PAC" edc:desc="Peripheral Access Controller" edc:irq="10" ltx:memberofperipheral="PAC"/>
    <edc:Interrupt edc:cname="RAMECC" edc:desc="RAM Error Correction Code" edc:irq="11" ltx:memberofperipheral="RAMECC"/>
    <edc:Interrupt edc:cname="SERCOM0" edc:desc="Serial Communication Interface 0" edc:irq="12" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:cname="SERCOM1" edc:desc="Serial Communication Interface 1" edc:irq="13" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:cname="SERCOM2" edc:desc="Serial Communication Interface 2" edc:irq="14" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:cname="SERCOM3" edc:desc="Serial Communication Interface 3" edc:irq="15" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:cname="TCC0" edc:desc="Timer/Counter for Control Applications 0" edc:irq="16" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:cname="TCC1" edc:desc="Timer/Counter for Control Applications 1" edc:irq="17" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:cname="TCC2" edc:desc="Timer/Counter for Control Applications 2" edc:irq="18" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:cname="TC0" edc:desc="Timer/Counter 0" edc:irq="19" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:cname="TC1" edc:desc="Timer/Counter 1" edc:irq="20" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:cname="TC2" edc:desc="Timer/Counter 2" edc:irq="21" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:cname="TC3" edc:desc="Timer/Counter 3" edc:irq="22" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:cname="ADCHS" edc:desc="Analog-to-Digital Converter" edc:irq="23" ltx:memberofperipheral="ADCHS"/>
    <edc:Interrupt edc:cname="AC" edc:desc="Analog Comparators" edc:irq="24" ltx:memberofperipheral="AC"/>
    <edc:Interrupt edc:cname="AES" edc:desc="Advanced Encryption Standard" edc:irq="25" ltx:memberofperipheral="AES"/>
    <edc:Interrupt edc:cname="TRNG" edc:desc="True Random Generator" edc:irq="26" ltx:memberofperipheral="TRNG"/>
    <edc:Interrupt edc:cname="ICM" edc:desc="Integrity Check Monitor" edc:irq="27" ltx:memberofperipheral="ICM"/>
    <edc:Interrupt edc:cname="PUKCC" edc:desc="Public-Key Cryptography Controller" edc:irq="28" ltx:memberofperipheral="PUKCC"/>
    <edc:Interrupt edc:cname="QSPI" edc:desc="Quad SPI interface" edc:irq="29" ltx:memberofperipheral="QSPI"/>
    <edc:Interrupt edc:cname="ZB_INT0" edc:desc="ZIGBEE" edc:irq="30" ltx:memberofperipheral="ZIGBEE"/>
    <edc:Interrupt edc:cname="BT_INT0" edc:desc="Bluetooth 0" edc:irq="31" ltx:memberofperipheral="BLE"/>
    <edc:Interrupt edc:cname="BT_INT1" edc:desc="Bluetooth 0" edc:irq="32" ltx:memberofperipheral="BLE"/>
    <edc:Interrupt edc:cname="ARBITER" edc:desc="Radio Arbiter" edc:irq="33" ltx:memberofperipheral="ARB"/>
    <edc:Interrupt edc:cname="ADC_FAULT" edc:desc="ADC Fault Interrupt" edc:irq="34" ltx:memberofperipheral="ADCHS"/>
    <edc:Interrupt edc:cname="ADC_FCC" edc:desc="ADC FCC Interrupt" edc:irq="35" ltx:memberofperipheral="ADCHS"/>
    <edc:Interrupt edc:cname="ADC_BGVR_RDY" edc:desc="ADC BGVR Ready" edc:irq="36" ltx:memberofperipheral="ADCHS"/>
    <edc:Interrupt edc:cname="CLKI_WAKEUP_NMI" edc:desc="Bluetooth WAKEUP" edc:irq="37" ltx:memberofperipheral="BLE"/>
    <edc:Interrupt edc:cname="BT_LC" edc:desc="Bluetooth LC" edc:irq="38" ltx:memberofperipheral="BLE"/>
    <edc:Interrupt edc:cname="BT_RC" edc:desc="Bluetooth RC" edc:irq="39" ltx:memberofperipheral="BLE"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="AC" edc:desc=""/>
    <edc:Peripheral edc:cname="ADCHS" edc:desc=""/>
    <edc:Peripheral edc:cname="AES" edc:desc=""/>
    <edc:Peripheral edc:cname="BLE" edc:desc=""/>
    <edc:Peripheral edc:cname="BTZBSYS" edc:desc=""/>
    <edc:Peripheral edc:cname="CCL" edc:desc=""/>
    <edc:Peripheral edc:cname="CFG" edc:desc=""/>
    <edc:Peripheral edc:cname="CMCC" edc:desc=""/>
    <edc:Peripheral edc:cname="CRU" edc:desc=""/>
    <edc:Peripheral edc:cname="RCON" edc:desc=""/>
    <edc:Peripheral edc:cname="DMAC" edc:desc=""/>
    <edc:Peripheral edc:cname="DMT" edc:desc=""/>
    <edc:Peripheral edc:cname="DSCON" edc:desc=""/>
    <edc:Peripheral edc:cname="DSU" edc:desc=""/>
    <edc:Peripheral edc:cname="EIC" edc:desc=""/>
    <edc:Peripheral edc:cname="EVSYS" edc:desc=""/>
    <edc:Peripheral edc:cname="NVM" edc:desc=""/>
    <edc:Peripheral edc:cname="FREQM" edc:desc=""/>
    <edc:Peripheral edc:cname="FUSES" edc:desc=""/>
    <edc:Peripheral edc:cname="GPIOA" edc:desc=""/>
    <edc:Peripheral edc:cname="GPIOB" edc:desc=""/>
    <edc:Peripheral edc:cname="HMATRIX" edc:desc=""/>
    <edc:Peripheral edc:cname="ICM" edc:desc=""/>
    <edc:Peripheral edc:cname="PAC" edc:desc=""/>
    <edc:Peripheral edc:cname="PCHE" edc:desc=""/>
    <edc:Peripheral edc:cname="PFW" edc:desc=""/>
    <edc:Peripheral edc:cname="PMU" edc:desc=""/>
    <edc:Peripheral edc:cname="PPS" edc:desc=""/>
    <edc:Peripheral edc:cname="PUKCC" edc:desc=""/>
    <edc:Peripheral edc:cname="QSPI" edc:desc=""/>
    <edc:Peripheral edc:cname="RAMECC" edc:desc=""/>
    <edc:Peripheral edc:cname="RTC" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM0" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM1" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM2" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM3" edc:desc=""/>
    <edc:Peripheral edc:cname="TC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TC3" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TRNG" edc:desc=""/>
    <edc:Peripheral edc:cname="WDT" edc:desc=""/>
    <edc:Peripheral edc:cname="CoreDebug" edc:desc=""/>
    <edc:Peripheral edc:cname="DWT" edc:desc=""/>
    <edc:Peripheral edc:cname="ETM" edc:desc=""/>
    <edc:Peripheral edc:cname="FPU" edc:desc=""/>
    <edc:Peripheral edc:cname="ITM" edc:desc=""/>
    <edc:Peripheral edc:cname="MPU" edc:desc=""/>
    <edc:Peripheral edc:cname="NVIC" edc:desc=""/>
    <edc:Peripheral edc:cname="SysTick" edc:desc=""/>
    <edc:Peripheral edc:cname="SystemControl" edc:desc=""/>
    <edc:Peripheral edc:cname="TPI" edc:desc=""/>
    <edc:Peripheral edc:cname="ZIGBEE" edc:desc=""/>
    <edc:Peripheral edc:cname="ARB" edc:desc=""/>
  </edc:PeripheralList>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R0" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R1" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R2" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="8" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R3" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="12" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R4" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="16" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R5" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="20" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R6" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="24" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R7" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="28" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R8" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="32" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R9" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="36" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R10" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="40" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R11" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="44" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R12" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="48" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SP" edc:desc="Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="52" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MSP" edc:desc="Main Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="64" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PSP" edc:desc="Process Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="68" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LR" edc:desc="Link Register" edc:impl="0xFFFFFFFF" edc:mclr="11111111111111111111111111111111" edc:nmmrid="56" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PC" edc:desc="Program Counter" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="60" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnn--------nnnnnn-nnnnnnnnn" edc:cname="PSR" edc:desc="Program Status Register" edc:impl="0xFF00FDFF" edc:mclr="00000001000000000000000000000000" edc:nmmrid="72" edc:nzwidth="0x20" edc:por="00000001000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnn-------nnnn----------------" edc:cname="APSR" edc:desc="Application Program Status Register" edc:impl="0xF80F0000" edc:mclr="00000000000000000000000000000000" edc:nmmrid="76" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-----------------------rrrrrrrrr" edc:cname="IPSR" edc:desc="Interrupt Program Status Register" edc:impl="0x1FF" edc:mclr="00000000000000000000000000000000" edc:nmmrid="80" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-----rrr--------rrrrrr----------" edc:cname="EPSR" edc:desc="Execution Program Status Register" edc:impl="0x700FC00" edc:mclr="00000001000000000000000000000000" edc:nmmrid="84" edc:nzwidth="0x20" edc:por="00000001000000000000000000000000"/>
      <edc:SFRDef edc:access="-------------------------------n" edc:cname="PRIMASK" edc:desc="Priority Mask Register" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nmmrid="88" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-----------------------------nnn" edc:cname="CONTROL" edc:desc="Control Register" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nmmrid="100" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
    </edc:NMMRPlace>
    <edc:SFRDataSector edc:beginaddr="0x3000000" edc:endaddr="0x4000000" edc:regionid="CMCC" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x3000000" edc:endaddr="0x3001000" edc:regionid="CMCC_DATARAM" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x3001000" edc:endaddr="0x3001400" edc:regionid="CMCC_TAGRAM" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x3002000" edc:endaddr="0x3002040" edc:regionid="CMCC_VALIDRAM" edc:rw="rw"/>
    <edc:GPRDataSector edc:beginaddr="0x20000000" edc:endaddr="0x20020000" edc:isexecutable="true" edc:regionid="HSRAM" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x40000000" edc:endaddr="0x40002C88" edc:regionid="PBA" edc:rw="rw">
      <edc:SFRDef edc:_addr="0x40000000" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WRCTRL" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PERID" edc:desc="Peripheral identifier" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Peripheral access control key" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No action" edc:when="(field &amp; 0xFF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLR" edc:desc="Clear protection" edc:when="(field &amp; 0xFF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set protection" edc:when="(field &amp; 0xFF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SETLCK" edc:desc="Set and lock protection" edc:when="(field &amp; 0xFF) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
