Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:AdjustPoint edc:_addr="0x41000003" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x41000004" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="AMOD" edc:desc="Access Mode" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41000008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="LENGTH" edc:impl="0xFFFFFFFC" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LENGTH" edc:desc="Length" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100000C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41000010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCC0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41000014" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCC1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41000018" edc:access="rrrrrrrrr-rrrrrrrrrrrrrrrrrrrrrr" edc:cname="DID" edc:impl="0xFFBFFFFF" edc:mclr="00000000000000001001101110001111" edc:nzwidth="0x20" edc:por="00000000000000001001101110001111" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DEVSEL" edc:desc="Device Select" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:desc="Die Number" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SERIES" edc:desc="Series" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="Cortex-M0+ processor, basic feature set" edc:when="(field &amp; 0x3F) == 0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Cortex-M0+ processor, USB" edc:when="(field &amp; 0x3F) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FAMILY" edc:desc="Family" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="General purpose microcontroller" edc:when="(field &amp; 0x1F) == 0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="PicoPower" edc:when="(field &amp; 0x1F) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Revision Number" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100001C" edc:offset="0xFE4"/>
      <edc:SFRDef edc:_addr="0x41001000" edc:access="rrrrrrrrrrrrrrrrrrrr----------rr" edc:cname="ENTRY0" edc:impl="0xFFFFF003" edc:mclr="10011111000011111100000000000010" edc:nzwidth="0x20" edc:por="10011111000011111100000000000010" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="EPRES" edc:desc="Entry Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FMT" edc:desc="Format" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="ADDOFF" edc:desc="Address Offset" edc:nzwidth="0x14"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41001004" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ENTRY1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU"/>
      <edc:SFRDef edc:_addr="0x41001008" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="END" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="END" edc:desc="End Marker" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100100C" edc:offset="0xFC0"/>
      <edc:SFRDef edc:_addr="0x41001FCC" edc:access="-------------------------------r" edc:cname="MEMTYPE" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="SMEMP" edc:desc="System Memory Present" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41001FD0" edc:access="------------------------rrrrrrrr" edc:cname="PID4" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="JEPCC" edc:desc="JEP-106 Continuation Code" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FKBC" edc:desc="4KB count" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41001FD4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x41001FE0" edc:access="------------------------rrrrrrrr" edc:cname="PID0" edc:impl="0xFF" edc:mclr="00000000000000000000000011010000" edc:nzwidth="0x20" edc:por="00000000000000000000000011010000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PARTNBL" edc:desc="Part Number Low" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
