Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:SFRDef edc:_addr="0x41004014" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRICTRL0" edc:mclr="01000000010000000100000001000000" edc:nzwidth="0x20" edc:por="01000000010000000100000001000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="LVLPRI0" edc:desc="Level 0 Channel Priority Number" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="QOS0" edc:desc="Level 0 Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN0" edc:desc="Level 0 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLPRI1" edc:desc="Level 1 Channel Priority Number" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="QOS1" edc:desc="Level 1 Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN1" edc:desc="Level 1 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLPRI2" edc:desc="Level 2 Channel Priority Number" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="QOS2" edc:desc="Level 2 Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN2" edc:desc="Level 2 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLPRI3" edc:desc="Level 3 Channel Priority Number" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="QOS3" edc:desc="Level 3 Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN3" edc:desc="Level 3 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004018" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x41004020" edc:access="nnnn-nnn---nnnnn" edc:cname="INTPEND" edc:impl="0xF71F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="ID" edc:desc="Channel ID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TERR" edc:desc="Transfer Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:desc="Transfer Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Channel Suspend" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERR" edc:desc="CRC Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:desc="Fetch Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEND" edc:desc="Pending" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004022" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x41004024" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="INTSTATUS" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CHINT0" edc:desc="Channel 0 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT1" edc:desc="Channel 1 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT2" edc:desc="Channel 2 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT3" edc:desc="Channel 3 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT4" edc:desc="Channel 4 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT5" edc:desc="Channel 5 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT6" edc:desc="Channel 6 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT7" edc:desc="Channel 7 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT8" edc:desc="Channel 8 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT9" edc:desc="Channel 9 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT10" edc:desc="Channel 10 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT11" edc:desc="Channel 11 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT12" edc:desc="Channel 12 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT13" edc:desc="Channel 13 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT14" edc:desc="Channel 14 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT15" edc:desc="Channel 15 Pending Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
