Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:SFRDef edc:_addr="0x41008001" edc:access="------nn" edc:cname="INTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="RAMECC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="SINGLEE" edc:desc="Single Bit ECC Error Interrupt Enable Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUALE" edc:desc="Dual Bit ECC Error Interrupt Enable Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41008002" edc:access="------nn" edc:cname="INTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="RAMECC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="SINGLEE" edc:desc="Single Bit ECC Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUALE" edc:desc="Dual Bit ECC Error Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41008003" edc:access="-------r" edc:cname="STATUS" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="RAMECC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="ECCDIS" edc:desc="ECC Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41008004" edc:access="--------------rrrrrrrrrrrrrrrrrr" edc:cname="ERRADDR" edc:impl="0x3FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RAMECC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="ERRADDR" edc:desc="Error Address" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41008008" edc:offset="0x7"/>
      <edc:SFRDef edc:_addr="0x4100800F" edc:access="------nn" edc:cname="DBGCTRL" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="RAMECC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="ECCDIS" edc:desc="ECC Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECCELOG" edc:desc="ECC Error Log" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41008010" edc:offset="0x8FF0"/>
      <edc:SFRDef edc:_addr="0x41011000" edc:access="----------------------nnnnnnnnnn" edc:cname="ARB_BT_CTRL" edc:impl="0x3FF" edc:mclr="00000000000000000000000000001010" edc:nzwidth="0x20" edc:por="00000000000000000000000000001010" ltx:memberofperipheral="ARB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="MAX_ABORT_TIME_BT" edc:desc="BT max abort time" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ALLOW_OPT_RX_BT" edc:desc="BT allow optimistic rx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOW_OPT_TX_BT" edc:desc="BT allow optimistic tx" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41011004" edc:access="----------------------nnnnnnnnnn" edc:cname="ARB_ZB_CTRL" edc:impl="0x3FF" edc:mclr="00000000000000000000000000001010" edc:nzwidth="0x20" edc:por="00000000000000000000000000001010" ltx:memberofperipheral="ARB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="MAX_ABORT_TIME_ZB" edc:desc="ZB max abort time" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ALLOW_OPT_RX_ZB" edc:desc="ZB allow optimistic rx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOW_OPT_TX_ZB" edc:desc="ZB allow optimistic tx" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41011008" edc:access="---------------------nnnnnnnnnnn" edc:cname="ARB_EVENT_CTRL" edc:impl="0x7FF" edc:mclr="00000000000000000000000000000001" edc:nzwidth="0x20" edc:por="00000000000000000000000000000001" ltx:memberofperipheral="ARB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="START_TIME_ALLOWANCE" edc:desc="minimum change needed in the start time to be considered as an arbitration event." edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USE_END_TIME_AS_EVENT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USE_START_TIME_AS_EVENT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USE_PRIO_AS_EVENT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DELAYED_OK_TASKS_DONT_WAIT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESOLVE_EQUAL_PRIO" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ABORT_IN_STATIC_MODE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4101100C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn----nnnn" edc:cname="ARB_CORE_CTRL" edc:impl="0xFFFFFF0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ARB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="RADIO_ARB_MODE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TESTBUS_SELECT" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="AD_ARB_SOFT_RESET" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARB_TESTBUS_BYTE_SELECT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="Reserved" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="RAD_ARB_TIMEOUT" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
