Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:SFRDef edc:_addr="0x4201008C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BKUP3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="BKUP" edc:desc="Backup" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42010090" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BKUP4" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="BKUP" edc:desc="Backup" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42010094" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BKUP5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="BKUP" edc:desc="Backup" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42010098" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BKUP6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="BKUP" edc:desc="Backup" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4201009C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BKUP7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="BKUP" edc:desc="Backup" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420100A0" edc:offset="0xF60"/>
      <edc:SFRDef edc:_addr="0x42011000" edc:access="----------------n-nn---n------nn" edc:cname="DSCON" edc:impl="0xB103" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSCON">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSCON">
            <edc:SFRFieldDef edc:cname="DSSR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ZPBOR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RTCCWDIS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RTCPWREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XSEMAEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42011004" edc:access="-----------------------nn-nnnnn-" edc:cname="DSWSRC" edc:impl="0x1BE" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSCON">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSCON">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSWDT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT0" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42011008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSSEMA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSCON">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSCON">
            <edc:SFRFieldDef edc:cname="DSSEMA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x44000000" edc:endaddr="0x44013E60" edc:regionid="PB_PIC" edc:rw="rw">
      <edc:SFRDef edc:_addr="0x44000000" edc:access="-nnn-nnnnnnnnnnnnnnnnnnnnn-nnnnn" edc:cname="CFGCON0" edc:impl="0x77FFFFDF" edc:mclr="01110001000000000000000000001011" edc:nzwidth="0x20" edc:por="01110001000000000000000000001011" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="TDOEN" edc:desc="TDO enable for 2-wire JTAG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWOEN" edc:desc="SWO enable on 2-wire debug interface" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TROEN" edc:desc="Trace Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCPOVR" edc:desc="ADC Charge Pump Override" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACCMP1_ALTEN" edc:desc="AC CMP1 Alternate Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPENFILT" edc:desc="ADC CP Filter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCIN0_ALTEN" edc:desc="RTCIN0 Alternate Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCOUT_ALTEN" edc:desc="RTCOUT Alternate Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMULOCK" edc:desc="PMU Controller Register LOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGLCOK" edc:desc="Permission Group LOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMDLOCK" edc:desc="Peripheral Module Disable (PMD) LOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IOLOCK" edc:desc="IO LOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGCLOCK" edc:desc="Configuration Register Lock" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="VBCMODE" edc:desc="VBC Operating Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBUSEN0" edc:desc="SMBus Enable for SERCOM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBUSEN1" edc:desc="SMBus Enable for SERCOM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBUSEN2" edc:desc="SMBus Enable for SERCOM2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPLUGDIS" edc:desc="Hot Plugging Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLRTEN0" edc:desc="SLRT Enable for SERCOM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLRTEN1" edc:desc="SLRT Enable for SERCOM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLRTEN2" edc:desc="SLRT Enable for SERCOM2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCM" edc:desc="PCHE I/D Cacheable Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT0E" edc:desc="INT0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INT0P" edc:desc="INT0P Polarity" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FECCCON" edc:desc="Flash ECC Control" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FRECCDIS" edc:desc="Flex RAM ECC Control" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000004" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGCON0CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x44000008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGCON0SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x4400000C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGCON0INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x44000010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn-nnn-nn" edc:cname="CFGCON1" edc:impl="0xFFFFFFBB" edc:mclr="00011111000000000100010000111011" edc:nzwidth="0x20" edc:por="00011111000000000100010000111011" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Access Selection" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICESEL" edc:desc="EMUC/EMUD Communication Channel Select" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRCEN" edc:desc="Trace Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ZBTWKSYS" edc:desc="ZBT Subsystem External Wake-up source" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP0_OE" edc:desc="Analog Comparator-0 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1_OE" edc:desc="Analog Comparator-1 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLASSBDIS" edc:desc="Disable CLASSB Device Functionality" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLRCTRL0" edc:desc="I2C Slew Rate Control for SERCOM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLRCTRL1" edc:desc="I2C Slew Rate Control for SERCOM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLRCTRL2" edc:desc="I2C Slew Rate Control for SERCOM2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMCLR" edc:desc="Selects CRU handling of MCLR Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QSCHE_EN" edc:desc="QSPI Address Space Cache Attribute" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QSPI_HSEN" edc:desc="QSPI (Direct) Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCOM0_HSEN" edc:desc="SERCOM0 (Direct)High Speed Pin Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCOM1_HSEN" edc:desc="SERCOM1 (Direct)High Speed Pin Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCOM2_HSEN" edc:desc="SERCOM2 (Direct)High Speed Pin Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_OE" edc:desc="CCL Pads (via PPS) Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2CDSEL0" edc:desc="I2C Delay Select for SERCOM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2CDSEL1" edc:desc="I2C Delay Select for SERCOM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2CDSEL2" edc:desc="I2C Delay Select for SERCOM2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTPSS" edc:desc="Watchdog Timer Post-scale Select Sleep" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="QSPIDDRM" edc:desc="QSPI DDR Mode Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKZBREF" edc:desc="External Reference Clock ZB Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FMPDAEN" edc:desc="FEM PD Analog Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
