Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:SFRDef edc:_addr="0x44000074" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGPCLKGEN2CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x44000078" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGPCLKGEN2SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x4400007C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGPCLKGEN2INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x44000080" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGPCLKGEN3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="EVSYSC9SEL" edc:desc="EVSYSC9 Peripheral Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="C9D" edc:desc="C9D Clock Disable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EVSYSC10SEL" edc:desc="EVSYSC10 Peripheral Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="C10D" edc:desc="C10D Clock Disable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EVSYSC11SEL" edc:desc="EVSYSC11 Peripheral Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="C11D" edc:desc="C11D Clock Disable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EVSYSC12SEL" edc:desc="EVSYSC12 Peripheral Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="C12D" edc:desc="C12D Clock Disable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACCLKSEL" edc:desc="AC Peripheral Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACCD" edc:desc="AC Clock Disable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TCC0CSEL" edc:desc="TCC0 Peripheral Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TCC0CD" edc:desc="TCC0 Clock Disable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC0CSEL" edc:desc="TC0 Peripheral Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC0CD" edc:desc="TC0 Clock Disable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC1CSEL" edc:desc="TC1 Peripheral Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_CLK" edc:desc="No Clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="REFO1" edc:desc="Reference Clock 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="Reference Clock 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="Reference Clock 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="REFO4" edc:desc="Reference Clock 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="REFO5" edc:desc="Reference Clock 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="REFO6" edc:desc="Reference Clock 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="LPCLK" edc:desc="32 KHz Low Power Clock" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC1CD" edc:desc="TC1 Clock Disable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable PGCLK" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable PGCLK" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000084" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGPCLKGEN3CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x44000088" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGPCLKGEN3SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x4400008C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGPCLKGEN3INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x44000090" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ID" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:AdjustPoint edc:_addr="0x44000094" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x440000A0" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="USER_ID" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="USER_ID" edc:desc="User unique ID, readable using the JTAG USER_ID instruction" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440000A4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USER_IDCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x440000A8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USER_IDSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x440000AC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USER_IDINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x440000B0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYSKEY" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="SYSKEY" edc:desc="System Key" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x440000B4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x440000C0" edc:access="--n------------n-------nnn-nnnnn" edc:cname="PMD1" edc:impl="0x200101DF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="ZBMD" edc:desc="ZigBee Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTMD" edc:desc="Bluetooth Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MPAMD" edc:desc="RF MPA Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPAMD" edc:desc="RF LPA Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLVDMD" edc:desc="PLVD Module Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACMD" edc:desc="AC Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="ADC Controller Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCSARMD" edc:desc="Shared ADC SAR Core Module Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RTCCMD" edc:desc="RTCC Module Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="SQIMD" edc:desc="SQI Module Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440000C4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMD1CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x440000C8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMD1SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x440000CC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMD1INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x440000D0" edc:access="nnnn--nn------------------------" edc:cname="PMD2" edc:impl="0xF3000000" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="REFO5MD" edc:desc="Reference (Clock) Out 5 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFO6MD" edc:desc="Reference (Clock) Out 6 Module Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="REFO1MD" edc:desc="Reference (Clock) Out 1 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFO2MD" edc:desc="Reference (Clock) Out 2 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFO3MD" edc:desc="Reference (Clock) Out 3 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFO4MD" edc:desc="Reference (Clock) Out 4 Module Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440000D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMD2CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x440000D8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMD2SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x440000DC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMD2INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x440000E0" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="PMD3" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="SER1MD" edc:desc="SERCOM1 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SER2MD" edc:desc="SERCOM2 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SER3MD" edc:desc="SERCOM3 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SER4MD" edc:desc="SERCOM4 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICMMD" edc:desc="ICM Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUKCCMD" edc:desc="PUKCC Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RNGMD" edc:desc="TRNG Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AESMD" edc:desc="AES Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0MD" edc:desc="TC0 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1MD" edc:desc="TC1 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2MD" edc:desc="TC2 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC3MD" edc:desc="TC3 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC0MD" edc:desc="TCC0 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC1MD" edc:desc="TCC1 Module Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC2MD" edc:desc="TCC2 Module Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
