Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:SFRDef edc:_addr="0x440006F4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMLBWPCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM"/>
      <edc:SFRDef edc:_addr="0x440006F8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMLBWPSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM"/>
      <edc:SFRDef edc:_addr="0x440006FC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMLBWPINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM"/>
      <edc:SFRDef edc:_addr="0x44000700" edc:access="n-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMUBWP" edc:impl="0x80FFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="UBWP0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP23" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000704" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMUBWPCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM"/>
      <edc:SFRDef edc:_addr="0x44000708" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMUBWPSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM"/>
      <edc:SFRDef edc:_addr="0x4400070C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMUBWPINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM"/>
      <edc:AdjustPoint edc:_addr="0x44000710" edc:offset="0xF0"/>
      <edc:SFRDef edc:_addr="0x44000800" edc:access="----------------nnn-------------" edc:cname="IFT_CON" edc:impl="0xE000" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PFW">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000804" edc:access="nnnnnnnnnnnnnnnnnnnn---------nnn" edc:cname="IFT_CRCCON" edc:impl="0xFFFFF007" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PFW">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="AUTOR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBITO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PAUSE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="PLEN32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERIOD" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000808" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFT_CRCMADR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PFW">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="IFT_CRCMADR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4400080C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFT_CRCMLEN" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PFW">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="CRCMLEN" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000810" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFT_CRCIV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PFW">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="CRCIV" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
