Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:SFRDef edc:_addr="0x44000A84" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO1TRIMCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000A88" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO1TRIMSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000A8C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO1TRIMINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000A90" edc:access="-nnnnnnnnnnnnnnnnnnnn-nn----nnnn" edc:cname="REFO2CON" edc:impl="0x7FFFFB0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="Reference Clock Source Select bits" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="REFCLKI" edc:desc="REFI Pin" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="SYSCLK" edc:desc="System clock (reference clock reflects any device clock switching)" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="PBCLK1" edc:desc="Peripheral clock 1 (reference clock reflects any peripheral clock switching)" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="SPLL3" edc:desc="System PLL3 (Clock-3)" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="LPRC" edc:desc="LPRC" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="SOSC" edc:desc="SOSC" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="POSC" edc:desc="POSC" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SPLL1" edc:desc="System PLL1 (Clock-1)" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="FRC" edc:when="(field &amp; 0xF) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="Reference Clock Request Status bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="Reference clock request is active (User should not update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NOT_ACTIVE" edc:desc="Reference clock request is not active (User can update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="Clock RODIV/ROTRIM switch enabled." edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SWINPROGRESS" edc:desc="Clock Divider Switching currently in progress." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SWCOMPLETE" edc:desc="Clock Divider Switch has completed." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="Reference Oscillator Run in Sleep bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="RSLP" edc:desc="Reference Oscillator output continues to run in Sleep" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_RSLP" edc:desc="Reference Oscillator output is disabled in Sleep" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="Reference Clock Output Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="REFO2_OE" edc:desc="Reference clock is driven out on REFO2 pin" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_REFO2_OE" edc:desc="Reference clock is not driven out on REFO2 pin." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="Peripheral Stop in Idle Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIDL" edc:desc="Discontinue module operation when device enters Idle mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_SIDL" edc:desc="Continue module operation in Idle mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="Freeze in Debug mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FRZ" edc:desc="When emulator is in Debug mode, module freezes operation" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_FRZ" edc:desc="When emulator is in Debug mode, module continues operation" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="Output Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Reference Oscillator Module enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Reference Oscillator Module disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="Reference Clock Divider bits" edc:nzwidth="0xF">
              <edc:SFRFieldSemantic edc:cname="65K" edc:desc="REFO2 clock is Base clock frequency divided by 65,534 (32,767 *2)" edc:when="(field &amp; 0x7FFF) == 0x7fff"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="REFO2 clock is Base clock frequency divided by 4 (2*2)" edc:when="(field &amp; 0x7FFF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="REFO2 clock is Base clock frequency divided by 2 (1*2)" edc:when="(field &amp; 0x7FFF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="REFO2 clock is same frequency as Base clock (no divider)" edc:when="(field &amp; 0x7FFF) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000A94" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO2CONCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000A98" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO2CONSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000A9C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO2CONINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000AA0" edc:access="nnnnnnnnn-----------------------" edc:cname="REFO2TRIM" edc:impl="0xFF800000" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:desc="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" edc:nzwidth="0x9">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="0/512 (0.0) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="1/512 (0.001953125) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="2/512 (0.00390625) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="256" edc:desc="256/512 (0.5000) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x100"/>
              <edc:SFRFieldSemantic edc:cname="511" edc:desc="511/512 (0.998046875) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x1ff"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000AA4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO2TRIMCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000AA8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO2TRIMSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000AAC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO2TRIMINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000AB0" edc:access="-nnnnnnnnnnnnnnnnnnnn-nn----nnnn" edc:cname="REFO3CON" edc:impl="0x7FFFFB0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="Reference Clock Source Select bits" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="REFCLKI" edc:desc="REFI Pin" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="SYSCLK" edc:desc="System clock (reference clock reflects any device clock switching)" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="PBCLK1" edc:desc="Peripheral clock 1 (reference clock reflects any peripheral clock switching)" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="SPLL3" edc:desc="System PLL3 (Clock-3)" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="LPRC" edc:desc="LPRC" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="SOSC" edc:desc="SOSC" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="POSC" edc:desc="POSC" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SPLL1" edc:desc="System PLL1 (Clock-1)" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="FRC" edc:when="(field &amp; 0xF) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="Reference Clock Request Status bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="Reference clock request is active (User should not update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NOT_ACTIVE" edc:desc="Reference clock request is not active (User can update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="Clock RODIV/ROTRIM switch enabled." edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SWINPROGRESS" edc:desc="Clock Divider Switching currently in progress." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SWCOMPLETE" edc:desc="Clock Divider Switch has completed." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="Reference Oscillator Run in Sleep bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="RSLP" edc:desc="Reference Oscillator output continues to run in Sleep" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_RSLP" edc:desc="Reference Oscillator output is disabled in Sleep" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="Reference Clock Output Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="REFO3_OE" edc:desc="Reference clock is driven out on REFO3 pin" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_REFO3_OE" edc:desc="Reference clock is not driven out on REFO3 pin." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="Peripheral Stop in Idle Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIDL" edc:desc="Discontinue module operation when device enters Idle mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_SIDL" edc:desc="Continue module operation in Idle mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="Freeze in Debug mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FRZ" edc:desc="When emulator is in Debug mode, module freezes operation" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_FRZ" edc:desc="When emulator is in Debug mode, module continues operation" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="Output Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Reference Oscillator Module enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Reference Oscillator Module disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="Reference Clock Divider bits" edc:nzwidth="0xF">
              <edc:SFRFieldSemantic edc:cname="65K" edc:desc="REFO3 clock is Base clock frequency divided by 65,534 (32,767 *2)" edc:when="(field &amp; 0x7FFF) == 0x7fff"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="REFO3 clock is Base clock frequency divided by 4 (2*2)" edc:when="(field &amp; 0x7FFF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="REFO3 clock is Base clock frequency divided by 2 (1*2)" edc:when="(field &amp; 0x7FFF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="REFO3 clock is same frequency as Base clock (no divider)" edc:when="(field &amp; 0x7FFF) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000AB4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO3CONCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000AB8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO3CONSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000ABC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO3CONINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000AC0" edc:access="nnnnnnnnn-----------------------" edc:cname="REFO3TRIM" edc:impl="0xFF800000" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:desc="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" edc:nzwidth="0x9">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="0/512 (0.0) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="1/512 (0.001953125) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="2/512 (0.00390625) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="256" edc:desc="256/512 (0.5000) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x100"/>
              <edc:SFRFieldSemantic edc:cname="511" edc:desc="511/512 (0.998046875) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x1ff"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000AC4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO3TRIMCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000AC8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO3TRIMSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000ACC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO3TRIMINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000AD0" edc:access="-nnnnnnnnnnnnnnnnnnnn-nn----nnnn" edc:cname="REFO4CON" edc:impl="0x7FFFFB0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="Reference Clock Source Select bits" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="REFCLKI" edc:desc="REFI Pin" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="SYSCLK" edc:desc="System clock (reference clock reflects any device clock switching)" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="PBCLK1" edc:desc="Peripheral clock 1 (reference clock reflects any peripheral clock switching)" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="SPLL3" edc:desc="System PLL3 (Clock-3)" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="LPRC" edc:desc="LPRC" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="SOSC" edc:desc="SOSC" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="POSC" edc:desc="POSC" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SPLL1" edc:desc="System PLL1 (Clock-1)" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="FRC" edc:when="(field &amp; 0xF) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="Reference Clock Request Status bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="Reference clock request is active (User should not update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NOT_ACTIVE" edc:desc="Reference clock request is not active (User can update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="Clock RODIV/ROTRIM switch enabled." edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SWINPROGRESS" edc:desc="Clock Divider Switching currently in progress." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SWCOMPLETE" edc:desc="Clock Divider Switch has completed." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="Reference Oscillator Run in Sleep bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="RSLP" edc:desc="Reference Oscillator output continues to run in Sleep" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_RSLP" edc:desc="Reference Oscillator output is disabled in Sleep" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="Reference Clock Output Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="REFO4_OE" edc:desc="Reference clock is driven out on REFO4 pin" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_REFO4_OE" edc:desc="Reference clock is not driven out on REFO4 pin." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="Peripheral Stop in Idle Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIDL" edc:desc="Discontinue module operation when device enters Idle mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_SIDL" edc:desc="Continue module operation in Idle mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="Freeze in Debug mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FRZ" edc:desc="When emulator is in Debug mode, module freezes operation" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_FRZ" edc:desc="When emulator is in Debug mode, module continues operation" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="Output Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Reference Oscillator Module enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Reference Oscillator Module disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="Reference Clock Divider bits" edc:nzwidth="0xF">
              <edc:SFRFieldSemantic edc:cname="65K" edc:desc="REFO4 clock is Base clock frequency divided by 65,534 (32,767 *2)" edc:when="(field &amp; 0x7FFF) == 0x7fff"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="REFO4 clock is Base clock frequency divided by 4 (2*2)" edc:when="(field &amp; 0x7FFF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="REFO4 clock is Base clock frequency divided by 2 (1*2)" edc:when="(field &amp; 0x7FFF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="REFO4 clock is same frequency as Base clock (no divider)" edc:when="(field &amp; 0x7FFF) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
