Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:SFRDef edc:_addr="0x44000B44" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PB2DIVCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B48" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PB2DIVSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B4C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PB2DIVINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B50" edc:access="----------------n---n----nnnnnnn" edc:cname="PB3DIV" edc:impl="0x887F" edc:mclr="00000000000000001000100000000001" edc:nzwidth="0x20" edc:por="00000000000000001000100000000001" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="PB3 Peripheral Clock Divisor Control value" edc:nzwidth="0x7">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide by 1 PB3 Clock same frequency as sys_clk" edc:when="(field &amp; 0x7F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2 PB3 Clock is 1/2 of sys_clk" edc:when="(field &amp; 0x7F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV3" edc:desc="Divide by 3 PB3 Clock is 1/3 of sys_clk" edc:when="(field &amp; 0x7F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16 PB3 Clock is 1/16 of sys_clk" edc:when="(field &amp; 0x7F) == 0xf"/>
              <edc:SFRFieldSemantic edc:cname="DIV17" edc:desc="Divide by 17 PB3 Clock is 1/17 of sys_clk" edc:when="(field &amp; 0x7F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="DIV127" edc:desc="Divide by 127 PB3 Clock is 1/127 of sys_clk" edc:when="(field &amp; 0x7F) == 0x7e"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide by 128 PB3 Clock is 1/128 of sys_clk" edc:when="(field &amp; 0x7F) == 0x7f"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="PB3 Peripheral Clock Divisor Ready" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PB3RDY" edc:desc="Indicates the PB clock divisor logic is not switching divisors and the PB3DIV may be written." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NOT_PB3RDY" edc:desc="Indicates the PB clock divisor logic is currently switching values and the PB3DIV cannot be written." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PBDIVON" edc:desc="Output Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PB3ON" edc:desc="PB3 Output clock is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PB3OFF" edc:desc="PB3 Output clock is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000B54" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PB3DIVCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B58" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PB3DIVSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B5C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PB3DIVINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B60" edc:access="----nnnn----nnnn-----nnn-----nnn" edc:cname="SLEWCON" edc:impl="0xF0F0707" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="Clock Switch Slewing Active Status Bit - Read-Only" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FINAL" edc:desc="Clock Switch has reached its final value" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BUSY" edc:desc="Clock frequency is being actively Slewed" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DNEN" edc:desc="Clock slew enable for switching down to slower clocks" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Clock Slewing disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Clock Slewing enabled on a clock switch" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UPEN" edc:desc="Clock slew enable for switching up to faster clocks" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Clock Slewing disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Clock Slewing enabled on a clock switch OR exit from SLEEP" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SLWDIV" edc:desc="Divisor steps used when doing slewed clock switches" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Divisor used" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="Divide by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="4to2" edc:desc="Divide by 4, then by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="8to2" edc:desc="Divide by 8, then by 4, then by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="16to2" edc:desc="Divide by 16, then by 8, then by 4, then by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="32to2" edc:desc="Divide by 32, then by 16, then by 8, then by 4, then by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="64to2" edc:desc="Divide by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="128to2" edc:desc="Divide by 128, then by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SYSDIV" edc:desc="PBx Peripheral Clock Divisor Control value" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide by 1- sys_clk_out same frequency as sys_clk source - Default" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2- sys_clk_out is 1/2 of sys_clk source" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV3" edc:desc="Divide by 3- sys_clk_out is 1/3 of sys_clk source" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide by 4- sys_clk_out is 1/4 of sys_clk source" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV5" edc:desc="Divide by 5- sys_clk_out is 1/5 of sys_clk source" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV6" edc:desc="Divide by 6- sys_clk_out is 1/6 of sys_clk source" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV7" edc:desc="Divide by 7- sys_clk_out is 1/7 of sys_clk source" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide by 8- sys_clk_out is 1/8 of sys_clk source" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="DIV9" edc:desc="Divide by 9- sys_clk_out is 1/9 of sys_clk source" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="DIV10" edc:desc="Divide by 10- sys_clk_out is 1/10 of sys_clk source" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="DIV11" edc:desc="Divide by 11- sys_clk_out is 1/11 of sys_clk source" edc:when="(field &amp; 0xF) == 0xa"/>
              <edc:SFRFieldSemantic edc:cname="DIV12" edc:desc="Divide by 12- sys_clk_out is 1/12 of sys_clk source" edc:when="(field &amp; 0xF) == 0xb"/>
              <edc:SFRFieldSemantic edc:cname="DIV13" edc:desc="Divide by 13- sys_clk_out is 1/13 of sys_clk source" edc:when="(field &amp; 0xF) == 0xc"/>
              <edc:SFRFieldSemantic edc:cname="DIV14" edc:desc="Divide by 14- sys_clk_out is 1/14 of sys_clk source" edc:when="(field &amp; 0xF) == 0xd"/>
              <edc:SFRFieldSemantic edc:cname="DIV15" edc:desc="Divide by 15- sys_clk_out is 1/15 of sys_clk source" edc:when="(field &amp; 0xF) == 0xe"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16- sys_clk_out is 1/16 of sys_clk source" edc:when="(field &amp; 0xF) == 0xf"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SLWDLY" edc:desc="Number of clocks generated at each slew step for a clock switch" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="1 clock will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="2 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="3" edc:desc="3 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="4 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="5" edc:desc="5 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="6" edc:desc="6 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="7" edc:desc="7 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="9" edc:desc="9 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="10" edc:desc="10 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="11" edc:desc="11 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0xa"/>
              <edc:SFRFieldSemantic edc:cname="12" edc:desc="12 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0xb"/>
              <edc:SFRFieldSemantic edc:cname="13" edc:desc="13 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0xc"/>
              <edc:SFRFieldSemantic edc:cname="14" edc:desc="14 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0xd"/>
              <edc:SFRFieldSemantic edc:cname="15" edc:desc="15 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0xe"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 clocks will be generated at each slew step" edc:when="(field &amp; 0xF) == 0xf"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000B64" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SLEWCONCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B68" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SLEWCONSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B6C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SLEWCONINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B70" edc:access="----------------------n---n-nnnn" edc:cname="CLKSTAT" edc:impl="0x22F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="FRCRDY" edc:desc="FRC Ready Status value" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOTRDY" edc:desc="FRC is not stable and not ready" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RDY" edc:desc="FRC is stable and ready" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPLL1RDY" edc:desc="System PLL1 Ready Status value" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOTRDY" edc:desc="SPLL1 Primary Output is not stable and not ready" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RDY" edc:desc="SPLL1 Primary Output is stable and ready" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POSCRDY" edc:desc="Primary Oscillator Ready Status value" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOTRDY" edc:desc="POSC is not stable and not ready" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RDY" edc:desc="POSC is stable and ready" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SOSCRDY" edc:desc="SOSC Ready Status value" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOTRDY" edc:desc="SOSC is not stable and not ready" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RDY" edc:desc="SOSC is stable and ready" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPRCRDY" edc:desc="LPRC Ready Status value" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOTRDY" edc:desc="LPRC is not stable and not ready" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RDY" edc:desc="LPRC is stable and ready" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SPLL3RDY" edc:desc="System PLL3 Ready Status value" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOTRDY" edc:desc="SPLL3 Output is not stable and not ready" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RDY" edc:desc="SPLL3 Output is stable and ready" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x44000B74" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x44000B90" edc:access="nnnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="CLKDIAG" edc:impl="0xFFFF007F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="POSCSTOP" edc:desc="POSC Clock Stop Control value" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORM" edc:desc="POSC clock source runs as normal" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="POSC clock source is stopped" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SOSCSTOP" edc:desc="SOSC Clock Stop Control value" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORM" edc:desc="SOSC clock source runs as normal" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="SOSC clock source is stopped" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRCSTOP" edc:desc="FRC Clock Stop Control value" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORM" edc:desc="FRC clock source runs as normal" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="FRC clock source is stopped" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPRCSTOP" edc:desc="LPRC Clock Stop Control value" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORM" edc:desc="LPRC clock source runs as normal" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="LPRC clock source is stopped" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPLL1STOP" edc:desc="SPLL1 Clock Stop Control value" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORM" edc:desc="SPLL1 clock source runs as normal" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="SPLL1 clock source is stopped" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPLL2STOP" edc:desc="SPLL2 Clock Stop Control value" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORM" edc:desc="SPLL2 clock source runs as normal" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="SPLL2 clock source is stopped" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPLL3STOP" edc:desc="SPLL3 Clock Stop Control value" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORM" edc:desc="SPLL3 clock source runs as normal" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="SPLL3 clock source is stopped" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="NMICNT" edc:desc="NMI Counter value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x44000B94" edc:offset="0x26C"/>
      <edc:SFRDef edc:_addr="0x44000E00" edc:access="----------------n---------------" edc:cname="DMTCON" edc:impl="0x8000" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMT">
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
