Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:SFRDef edc:_addr="0x440012F0" edc:access="---------------------------nnnnn" edc:cname="RPB12G2R" edc:impl="0x1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PPS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="RPB12G2R" edc:desc="RPB12/G2" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0x1F) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P0" edc:desc="SERCOM0/PAD0" edc:when="(field &amp; 0x1F) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P3" edc:desc="SERCOM0/PAD3" edc:when="(field &amp; 0x1F) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P2" edc:desc="SERCOM0/PAD2" edc:when="(field &amp; 0x1F) == 3"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P1" edc:desc="SERCOM1/PAD1" edc:when="(field &amp; 0x1F) == 4"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P3" edc:desc="SERCOM1/PAD3" edc:when="(field &amp; 0x1F) == 5"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P2" edc:desc="SERCOM1/PAD2" edc:when="(field &amp; 0x1F) == 6"/>
              <edc:SFRFieldSemantic edc:cname="SCOM2P1" edc:desc="SERCOM2/PAD1" edc:when="(field &amp; 0x1F) == 7"/>
              <edc:SFRFieldSemantic edc:cname="SCOM2P2" edc:desc="SERCOM2/PAD2" edc:when="(field &amp; 0x1F) == 8"/>
              <edc:SFRFieldSemantic edc:cname="SCOM3P1" edc:desc="SERCOM3/PAD1" edc:when="(field &amp; 0x1F) == 9"/>
              <edc:SFRFieldSemantic edc:cname="SCOM3P0" edc:desc="SERCOM3/PAD0" edc:when="(field &amp; 0x1F) == 10"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO1" edc:desc="TCC0/WO1" edc:when="(field &amp; 0x1F) == 11"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO5" edc:desc="TCC0/WO5" edc:when="(field &amp; 0x1F) == 12"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO3" edc:desc="TCC0/WO3" edc:when="(field &amp; 0x1F) == 13"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO1" edc:desc="TCC1/WO1" edc:when="(field &amp; 0x1F) == 14"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO5" edc:desc="TCC1/WO5" edc:when="(field &amp; 0x1F) == 15"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO3" edc:desc="TCC1/WO3" edc:when="(field &amp; 0x1F) == 16"/>
              <edc:SFRFieldSemantic edc:cname="TCC2WO1" edc:desc="TCC2/WO1" edc:when="(field &amp; 0x1F) == 17"/>
              <edc:SFRFieldSemantic edc:cname="TC0WO1" edc:desc="TC0/WO1" edc:when="(field &amp; 0x1F) == 18"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="REFO2" edc:when="(field &amp; 0x1F) == 19"/>
              <edc:SFRFieldSemantic edc:cname="TC1WO1" edc:desc="TC1/WO1" edc:when="(field &amp; 0x1F) == 20"/>
              <edc:SFRFieldSemantic edc:cname="TC2WO1" edc:desc="TC2/WO1" edc:when="(field &amp; 0x1F) == 21"/>
              <edc:SFRFieldSemantic edc:cname="TC3WO1" edc:desc="TC3/WO1" edc:when="(field &amp; 0x1F) == 22"/>
              <edc:SFRFieldSemantic edc:cname="QSCK" edc:desc="QSCK" edc:when="(field &amp; 0x1F) == 23"/>
              <edc:SFRFieldSemantic edc:cname="QCS" edc:desc="QCS" edc:when="(field &amp; 0x1F) == 24"/>
              <edc:SFRFieldSemantic edc:cname="QD0" edc:desc="QD0" edc:when="(field &amp; 0x1F) == 25"/>
              <edc:SFRFieldSemantic edc:cname="QD3" edc:desc="QD3" edc:when="(field &amp; 0x1F) == 26"/>
              <edc:SFRFieldSemantic edc:cname="QD2" edc:desc="QD2" edc:when="(field &amp; 0x1F) == 27"/>
              <edc:SFRFieldSemantic edc:cname="CCLOUT1" edc:desc="CCLOUT1" edc:when="(field &amp; 0x1F) == 28"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS1" edc:desc="TSTBUS1" edc:when="(field &amp; 0x1F) == 29"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS5" edc:desc="TSTBUS5" edc:when="(field &amp; 0x1F) == 30"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS9" edc:desc="TSTBUS9" edc:when="(field &amp; 0x1F) == 31"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440012F4" edc:access="---------------------------nnnnn" edc:cname="RPB13G2R" edc:impl="0x1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PPS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="RPB13G2R" edc:desc="RPB13/G2" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0x1F) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P0" edc:desc="SERCOM0/PAD0" edc:when="(field &amp; 0x1F) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P3" edc:desc="SERCOM0/PAD3" edc:when="(field &amp; 0x1F) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P2" edc:desc="SERCOM0/PAD2" edc:when="(field &amp; 0x1F) == 3"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P1" edc:desc="SERCOM1/PAD1" edc:when="(field &amp; 0x1F) == 4"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P3" edc:desc="SERCOM1/PAD3" edc:when="(field &amp; 0x1F) == 5"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P2" edc:desc="SERCOM1/PAD2" edc:when="(field &amp; 0x1F) == 6"/>
              <edc:SFRFieldSemantic edc:cname="SCOM2P1" edc:desc="SERCOM2/PAD1" edc:when="(field &amp; 0x1F) == 7"/>
              <edc:SFRFieldSemantic edc:cname="SCOM2P2" edc:desc="SERCOM2/PAD2" edc:when="(field &amp; 0x1F) == 8"/>
              <edc:SFRFieldSemantic edc:cname="SCOM3P1" edc:desc="SERCOM3/PAD1" edc:when="(field &amp; 0x1F) == 9"/>
              <edc:SFRFieldSemantic edc:cname="SCOM3P0" edc:desc="SERCOM3/PAD0" edc:when="(field &amp; 0x1F) == 10"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO1" edc:desc="TCC0/WO1" edc:when="(field &amp; 0x1F) == 11"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO5" edc:desc="TCC0/WO5" edc:when="(field &amp; 0x1F) == 12"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO3" edc:desc="TCC0/WO3" edc:when="(field &amp; 0x1F) == 13"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO1" edc:desc="TCC1/WO1" edc:when="(field &amp; 0x1F) == 14"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO5" edc:desc="TCC1/WO5" edc:when="(field &amp; 0x1F) == 15"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO3" edc:desc="TCC1/WO3" edc:when="(field &amp; 0x1F) == 16"/>
              <edc:SFRFieldSemantic edc:cname="TCC2WO1" edc:desc="TCC2/WO1" edc:when="(field &amp; 0x1F) == 17"/>
              <edc:SFRFieldSemantic edc:cname="TC0WO1" edc:desc="TC0/WO1" edc:when="(field &amp; 0x1F) == 18"/>
              <edc:SFRFieldSemantic edc:cname="REFO2" edc:desc="REFO2" edc:when="(field &amp; 0x1F) == 19"/>
              <edc:SFRFieldSemantic edc:cname="TC1WO1" edc:desc="TC1/WO1" edc:when="(field &amp; 0x1F) == 20"/>
              <edc:SFRFieldSemantic edc:cname="TC2WO1" edc:desc="TC2/WO1" edc:when="(field &amp; 0x1F) == 21"/>
              <edc:SFRFieldSemantic edc:cname="TC3WO1" edc:desc="TC3/WO1" edc:when="(field &amp; 0x1F) == 22"/>
              <edc:SFRFieldSemantic edc:cname="QSCK" edc:desc="QSCK" edc:when="(field &amp; 0x1F) == 23"/>
              <edc:SFRFieldSemantic edc:cname="QCS" edc:desc="QCS" edc:when="(field &amp; 0x1F) == 24"/>
              <edc:SFRFieldSemantic edc:cname="QD0" edc:desc="QD0" edc:when="(field &amp; 0x1F) == 25"/>
              <edc:SFRFieldSemantic edc:cname="QD3" edc:desc="QD3" edc:when="(field &amp; 0x1F) == 26"/>
              <edc:SFRFieldSemantic edc:cname="QD2" edc:desc="QD2" edc:when="(field &amp; 0x1F) == 27"/>
              <edc:SFRFieldSemantic edc:cname="CCLOUT1" edc:desc="CCLOUT1" edc:when="(field &amp; 0x1F) == 28"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS1" edc:desc="TSTBUS1" edc:when="(field &amp; 0x1F) == 29"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS5" edc:desc="TSTBUS5" edc:when="(field &amp; 0x1F) == 30"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS9" edc:desc="TSTBUS9" edc:when="(field &amp; 0x1F) == 31"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440012F8" edc:access="---------------------------nnnnn" edc:cname="RPB13G3R" edc:impl="0x1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PPS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="RPB13G3R" edc:desc="RPB13/G3" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0x1F) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P1" edc:desc="SERCOM0/PAD1" edc:when="(field &amp; 0x1F) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P0" edc:desc="SERCOM0/PAD0" edc:when="(field &amp; 0x1F) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P3" edc:desc="SERCOM0/PAD3" edc:when="(field &amp; 0x1F) == 3"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P2" edc:desc="SERCOM1/PAD2" edc:when="(field &amp; 0x1F) == 4"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P0" edc:desc="SERCOM1/PAD0" edc:when="(field &amp; 0x1F) == 5"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P3" edc:desc="SERCOM1/PAD3" edc:when="(field &amp; 0x1F) == 6"/>
              <edc:SFRFieldSemantic edc:cname="SCOM2P2" edc:desc="SERCOM2/PAD2" edc:when="(field &amp; 0x1F) == 7"/>
              <edc:SFRFieldSemantic edc:cname="SCOM2P3" edc:desc="SERCOM2/PAD3" edc:when="(field &amp; 0x1F) == 8"/>
              <edc:SFRFieldSemantic edc:cname="SCOM3P2" edc:desc="SERCOM3/PAD2" edc:when="(field &amp; 0x1F) == 9"/>
              <edc:SFRFieldSemantic edc:cname="SCOM3P1" edc:desc="SERCOM3/PAD1" edc:when="(field &amp; 0x1F) == 10"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO2" edc:desc="TCC0/WO2" edc:when="(field &amp; 0x1F) == 11"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO0" edc:desc="TCC0/WO0" edc:when="(field &amp; 0x1F) == 12"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO4" edc:desc="TCC0/WO4" edc:when="(field &amp; 0x1F) == 13"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO2" edc:desc="TCC1/WO2" edc:when="(field &amp; 0x1F) == 14"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO0" edc:desc="TCC1/WO0" edc:when="(field &amp; 0x1F) == 15"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO4" edc:desc="TCC1/WO4" edc:when="(field &amp; 0x1F) == 16"/>
              <edc:SFRFieldSemantic edc:cname="TCC2WO0" edc:desc="TCC2/WO0" edc:when="(field &amp; 0x1F) == 17"/>
              <edc:SFRFieldSemantic edc:cname="TC0WO0" edc:desc="TC0/WO0" edc:when="(field &amp; 0x1F) == 18"/>
              <edc:SFRFieldSemantic edc:cname="REFO3" edc:desc="REFO3" edc:when="(field &amp; 0x1F) == 19"/>
              <edc:SFRFieldSemantic edc:cname="TC1WO0" edc:desc="TC1/WO0" edc:when="(field &amp; 0x1F) == 20"/>
              <edc:SFRFieldSemantic edc:cname="TC2WO0" edc:desc="TC2/WO0" edc:when="(field &amp; 0x1F) == 21"/>
              <edc:SFRFieldSemantic edc:cname="TC3WO0" edc:desc="TC3/WO0" edc:when="(field &amp; 0x1F) == 22"/>
              <edc:SFRFieldSemantic edc:cname="QSCK" edc:desc="QSCK" edc:when="(field &amp; 0x1F) == 23"/>
              <edc:SFRFieldSemantic edc:cname="QCS" edc:desc="QCS" edc:when="(field &amp; 0x1F) == 24"/>
              <edc:SFRFieldSemantic edc:cname="QD1" edc:desc="QD1" edc:when="(field &amp; 0x1F) == 25"/>
              <edc:SFRFieldSemantic edc:cname="QD0" edc:desc="QD0" edc:when="(field &amp; 0x1F) == 26"/>
              <edc:SFRFieldSemantic edc:cname="QD3" edc:desc="QD3" edc:when="(field &amp; 0x1F) == 27"/>
              <edc:SFRFieldSemantic edc:cname="CCLOUT0" edc:desc="CCLOUT0" edc:when="(field &amp; 0x1F) == 28"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS2" edc:desc="TSTBUS2" edc:when="(field &amp; 0x1F) == 29"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS6" edc:desc="TSTBUS6" edc:when="(field &amp; 0x1F) == 30"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS10" edc:desc="TSTBUS10" edc:when="(field &amp; 0x1F) == 31"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x440012FC" edc:offset="0x104"/>
      <edc:SFRDef edc:_addr="0x44001400" edc:access="--------nnnnnnnnnnn--nnn-nnnnnnn" edc:cname="ADCCON1" edc:impl="0xFFE77F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="DMABL" edc:desc="DMA to System RAM Buffer Length Size bits" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="128_DMABL" edc:desc="Allocates 128 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="64_DMABL" edc:desc="Allocates 64 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="32_DMABL" edc:desc="Allocates 32 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="16_DMABL" edc:desc="Allocates 16 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="8_DMABL" edc:desc="Allocates 8 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="4_DMABL" edc:desc="Allocates 4 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="2_DMABL" edc:desc="Allocates 2 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="1_DMABL" edc:desc="Allocates 1 location in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STRGLVL" edc:desc="Scan Trigger High Level/Positive Edge Sensitivity bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SCTRIG_HIGH" edc:desc="Scan trigger is high level sensitive. Once STRIG mode is selected the scan trigger will continue for all selected analog inputs" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SCTRIG_POSEDGE" edc:desc="Scan trigger is positive edge sensitive. Once STRIG mode is selected only a single scan trigger will be generated which will complete the scan of all selected analog inputs. (TRGSRCx in the ADCTRGx register)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IRQVS" edc:desc="Interrupt Vector Shift bits" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SHL_7" edc:desc="Shift x left 7 bit position" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="SHL_6" edc:desc="Shift x left 6 bit position" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="SHL_5" edc:desc="Shift x left 5 bit position" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="SHL_4" edc:desc="Shift x left 4 bit position" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="SHL_3" edc:desc="Shift x left 3 bit position" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SHL_2" edc:desc="Shift x left 2 bit position" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SHL_1" edc:desc="Shift x left 1 bit position" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SHL_0" edc:desc="Shift x left 0 bit position" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SCANEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSYUPB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSYDMA" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="Stop in Idle Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISCONTINUE" edc:desc="Discontinue module operation when device enters Idle mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CONTINUE" edc:desc="Continue module operation in Idle mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="ADC Module Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="ADC module is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="ADC module is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STRGSRC" edc:desc="Scan Trigger Source Select bits" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="EXT_TRIG_VAL" edc:desc="External trigger for validation" edc:when="(field &amp; 0x1F) == 0x1f"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_47" edc:desc="ADC_TRIG_16" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_46" edc:desc="ADC_TRIG_15" edc:when="(field &amp; 0x1F) == 0xf"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_45" edc:desc="ADC_TRIG_14" edc:when="(field &amp; 0x1F) == 0xe"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_44" edc:desc="ADC_TRIG_13" edc:when="(field &amp; 0x1F) == 0xd"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_43" edc:desc="ADC_TRIG_12" edc:when="(field &amp; 0x1F) == 0xc"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_42" edc:desc="ADC_TRIG_11" edc:when="(field &amp; 0x1F) == 0xb"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_41" edc:desc="ADC_TRIG_10" edc:when="(field &amp; 0x1F) == 0xa"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_40" edc:desc="ADC_TRIG_9" edc:when="(field &amp; 0x1F) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_39" edc:desc="ADC_TRIG_8" edc:when="(field &amp; 0x1F) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_38" edc:desc="ADC_TRIG_7" edc:when="(field &amp; 0x1F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_37" edc:desc="ADC_TRIG_6" edc:when="(field &amp; 0x1F) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_36" edc:desc="ADC_TRIG_5" edc:when="(field &amp; 0x1F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="INT0" edc:desc="INT0" edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0x1F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SW_LVL" edc:desc="Software level trigger" edc:when="(field &amp; 0x1F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SW_EDGE" edc:desc="Software edge trigger" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Trigger" edc:when="(field &amp; 0x1F) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SELRES" edc:desc="Shared ADC7 Resolution bits" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="12_BITS" edc:desc="12 bits (default)" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="10_BITS" edc:desc="10 bits" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="8_BITS" edc:desc="8 bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="6_BITS" edc:desc="6 bits" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRACT" edc:desc="Fractional Data Output Format bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FRAC" edc:desc="Fractional" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="INT" edc:desc="Integer" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
