Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:SFRDef edc:_addr="0x44001404" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCON1CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x44001408" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCON1SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x4400140C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCON1INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x44001410" edc:access="nnn---nnnnnnnnnnnnn-nnnn-nnnnnnn" edc:cname="ADCCON2" edc:impl="0xE3FFEF7F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:desc="Shared ADC Clock Divider bits" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:desc="Shared ADC Early Interrupt Select bits" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="8CLKS_EARLY" edc:desc="The data ready interrupt is generated 8 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="7CLKS_EARLY" edc:desc="The data ready interrupt is generated 7 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="6CLKS_EARLY" edc:desc="The data ready interrupt is generated 6 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="5CLKS_EARLY" edc:desc="The data ready interrupt is generated 5 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="4CLKS_EARLY" edc:desc="The data ready interrupt is generated 4 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="3CLKS_EARLY" edc:desc="The data ready interrupt is generated 3 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="2CLKS_EARLY" edc:desc="The data ready interrupt is generated 2 ADC module clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="1CLKS_EARLY" edc:desc="The data ready interrupt is generated 1 ADC module clock prior to end of conversion" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ENXCNVRT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSIEN" edc:desc="End of Scan Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="EOSRDY_INT" edc:desc="Interrupt will be generated when EOSRDY bit is set" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NOEOSRDY_INT" edc:desc="No interrupt is generated when the EOSRDY bit is set" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="REFFLTIEN" edc:desc="Band Gap/ Vref Voltage Fault Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="REFFLT_INT" edc:desc="Interrupt will be generated when the REFFLT bit is set" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NOREFFLT_INT" edc:desc="No interrupt is generated when the REFFLT bit is set" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BGVRIEN" edc:desc="Band Gap/ Vref Voltage Ready Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="BGVRDDY_INT" edc:desc="Interrupt will be generated when the BGVRDDY bit is set" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NOBGVRDDY_INT" edc:desc="No interrupt is generated when the BGVRRDY bit is set" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SAMC" edc:desc="Sample Time for the Shared ADC (ADC7) bits" edc:nzwidth="0xA"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EOSRDY" edc:desc="End of Scan Interrupt Status bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SCAN_COMPLETE" edc:desc="All analog inputs are considered for scanning through the scan trigger (all analog inputs specified in the ADCCSS1 and ADCCSS2 registers) have completed scanning" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SCAN_NOT_COMPLETE" edc:desc="Scanning has not completed" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="REFFLT" edc:desc="Band Gap/ Vref / AVdd BOR Fault Status bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="BG_VREF_FLT" edc:desc="Fault in band gap or the Vref voltage while the ON bit (ADCCON1) was set. Most likely a band gap or Vref fault will be caused by a BOR of the analog Vdd supply." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BG_VREF_OK" edc:desc="Band gap and Vref voltage are working properly" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BGVRRDY" edc:desc="Band Gap Voltage/ADC Reference Voltage Status bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VREF_RDY" edc:desc="Both band gap voltage and ADC reference voltages (Vref) are ready" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="VREF_NOTRDY" edc:desc="Either or both band gap voltage and ADC reference voltages (Vref) are not ready" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44001414" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCON2CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x44001418" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCON2SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x4400141C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCON2INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x44001420" edc:access="nnnnnnnnn-------nnnnnnnnnnnnnnnn" edc:cname="ADCCON3" edc:impl="0xFF80FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="ADINSEL" edc:desc="Analog Input Select bits" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:cname="TMP_SENSE" edc:desc="CTMU Temperature Sensor (internal AN11)" edc:when="(field &amp; 0x3F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="VBATDIV2_SENSE" edc:desc="VBAT/2 (internal AN10)" edc:when="(field &amp; 0x3F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="1P2V_SENSE" edc:desc="IVref 1.2V (internal AN9)" edc:when="(field &amp; 0x3F) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="BGREF" edc:desc="BandGap Reference (internal AN8)" edc:when="(field &amp; 0x3F) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="AN7" edc:desc="AN7" edc:when="(field &amp; 0x3F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="AN6" edc:desc="AN6" edc:when="(field &amp; 0x3F) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AN5" edc:desc="AN5" edc:when="(field &amp; 0x3F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AN4" edc:desc="AN4" edc:when="(field &amp; 0x3F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AN3" edc:desc="AN3" edc:when="(field &amp; 0x3F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AN2" edc:desc="AN2" edc:when="(field &amp; 0x3F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AN1" edc:desc="AN1" edc:when="(field &amp; 0x3F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AN0" edc:desc="AN0" edc:when="(field &amp; 0x3F) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="GSWTRG" edc:desc="Global Software Trigger bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="GSWTRG" edc:desc="Trigger conversion for ADC inputs that have selected the GSWTRG bit as either through the associated TRGSRC bits in the ADCTRGx registers or through the STRGSRC&lt;4:0&gt; bits in the ADCCON1 register the trigger signal" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_GSWTRG" edc:desc="Do not trigger an analog-to-digital conversion" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="GLSWTRG" edc:desc="Global Level Software Trigger bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="GLSWTRG" edc:desc="Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_GLSWTRG" edc:desc="Do not trigger an analog-to-digital conversion" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RQCNVRT" edc:desc="Individual ADC Input Conversion Request bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="IND_TRIGGER" edc:desc="Trigger the conversion of the selected ADC input as specified by the ADINSEL bits" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_TRIGGER" edc:desc="Do not trigger the conversion" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SAMP" edc:desc="Shared ADC7 Analog Input Sampling Enable bit " edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SAMPLE" edc:desc="The ADC S&amp;H amplifier is sampling" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HOLD" edc:desc="The ADC S&amp;H amplifier is holding" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UPDRDY" edc:desc="ADC Update Ready Status bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="UPDATE_RDY" edc:desc="ADC SFRs can be updated" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE_NOT_RDY" edc:desc="ADC SFRs cannot be updated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UPDIEN" edc:desc="Update Ready Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="INT_ON_UPDATE_RDY" edc:desc="Interrupt will be generated when the UPDRDY bit is set by hardware" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_INT_ON_UPDATE_RDY" edc:desc="No interrupt is generated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGSUSP" edc:desc="Trigger Suspend bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="TRIG_BLOCKED" edc:desc="Triggers are blocked from starting a new analog-to-digital conversion" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TRIG_NOT_BLOCKED" edc:desc="Triggers are not blocked" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VREFSEL" edc:desc="Voltage Reference Input Selection bits" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="AVDD_AVSS" edc:desc="ADC VREFH is AVDD, ADC VREFL is AVSS" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DIGEN7" edc:desc="Shared ADC (ADC7) Digital Enable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CONCLKDIV" edc:desc="Analog-to-Digital Control Clock Divider bits" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCSEL" edc:desc="Analog-to-Digital Clock Source bits" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SYSCLK" edc:desc="SYSCLK" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="REFCLK3" edc:desc="REFCLK3" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="FRC" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PBCLK1" edc:desc="PBCLK1" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
