Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:SFRDef edc:_addr="0x44001424" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCON3CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x44001428" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCON3SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x4400142C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCON3INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:AdjustPoint edc:_addr="0x44001430" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x44001440" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCIMCON1" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="SIGN0" edc:desc="AN0 Signed Data Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN0 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN0 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF0" edc:desc="AN0 Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN0 differential input pair as AN0+ and ANN0-" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN0 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN1" edc:desc="AN1 Signed Data Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN1 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN1 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF1" edc:desc="AN1 Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN1 differential input pair as AN1+ and ANN0-" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN1 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN2" edc:desc="AN2 Signed Data Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN2 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN2 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF2" edc:desc="AN2 Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN2 differential input pair as AN2+ and ANN0-" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN2 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN3" edc:desc="AN3 Signed Data Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN3 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN3 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF3" edc:desc="AN3 Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN3 differential input pair as AN3+ and ANN0-" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN3 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN4" edc:desc="AN4 Signed Data Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN4 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN4 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF4" edc:desc="AN4 Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN4 differential input pair as AN4+ and ANN0-" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN4 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN5" edc:desc="AN5 Signed Data Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN5 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN5 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF5" edc:desc="AN5 Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN5 differential input pair as AN5+ and ANN0-" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN5 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN6" edc:desc="AN6 Signed Data Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN6 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN6 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF6" edc:desc="AN6 Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN6 differential input pair as AN6+ and ANN0-" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN6 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN7" edc:desc="AN7 Signed Data Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN7 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN7 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF7" edc:desc="AN7 Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN7 differential input pair as AN7+ and ANN0-" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN7 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN8" edc:desc="AN8 Signed Data Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN8 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN8 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF8" edc:desc="AN 8 Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN8 differential input pair as AN8+ and ANN0-" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN8 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN9" edc:desc="AN9 Signed Data Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN9 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN9 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF9" edc:desc="AN9 Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN9 differential input pair as AN9+ and ANN0-" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN9 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN10" edc:desc="AN10 Signed Data Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN10 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN10 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF10" edc:desc="AN10 Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN10 differential input pair as AN10+ and ANN0-" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN10 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN11" edc:desc="AN11 Signed Data Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN11 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN11 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF11" edc:desc="AN11 Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN11 differential input pair as AN11+ and ANN0-" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN11 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
