Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:SFRDef edc:_addr="0x44013E30" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMUSEQ3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="CMPBVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIRADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E34" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMUSEQ4" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="CMPBVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIRADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E38" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:cname="PMUCFG" edc:impl="0xFFFFFF7F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="BUCK_SW_DELAY" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDO_SW_DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="MLDOEXT_l" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BUCK_CP_L" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="BUCK_CP_H" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="ADC_CP_L" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="ADC_CP_H" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E3C" edc:access="nn-n---------nnn-----nnnnnnnnnnn" edc:cname="PMU_WCMCMD" edc:impl="0xD00707FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="WCMADDR" edc:nzwidth="0xB"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WCMCLKDIV" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="WCMRDU" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E40" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMU_WCMWDATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="WCMWDATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E44" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMU_WCMRDATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="WCMRDATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E48" edc:access="-n-n------------nnnnnnnnnnnnnnnn" edc:cname="PMU_VBCCMD" edc:impl="0x5000FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="VBCADDR" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="VBCRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E4C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMU_VBCWDATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="VBCWDATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E50" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMU_VBCRDATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="VBCRDATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E54" edc:access="-------------------------nnn-nnn" edc:cname="WCMCFG" edc:impl="0x77" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="WCM1CFG" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WCM2CFG" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E58" edc:access="---------------------------nnnnn" edc:cname="PMUIENB" edc:impl="0x1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="ADCBORIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKBORIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCMPIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WCMIAIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VBCIAIEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
