Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:AdjustPoint edc:_addr="0xE0041F04" edc:offset="0x9C"/>
      <edc:SFRDef edc:_addr="0xE0041FA0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMSET" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FA4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMCLR" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE0041FA8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0xE0041FB0" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="LAR" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FB4" edc:access="-----------------------------rrr" edc:cname="LSR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="ETM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ETM">
            <edc:SFRFieldDef edc:cname="Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Access" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ByteAcc" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0041FB8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="AUTHSTATUS" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE0041FBC" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0xE0041FCC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVTYPE" edc:mclr="00000000000000000000000000010011" edc:nzwidth="0x20" edc:por="00000000000000000000000000010011" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FD0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR4" edc:mclr="00000000000000000000000000000100" edc:nzwidth="0x20" edc:por="00000000000000000000000000000100" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FE0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR0" edc:mclr="00000000000000000000000000100101" edc:nzwidth="0x20" edc:por="00000000000000000000000000100101" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FE4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR1" edc:mclr="00000000000000000000000010111001" edc:nzwidth="0x20" edc:por="00000000000000000000000010111001" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FE8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR2" edc:mclr="00000000000000000000000000001011" edc:nzwidth="0x20" edc:por="00000000000000000000000000001011" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FEC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FF0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CIDR0" edc:mclr="00000000000000000000000000001101" edc:nzwidth="0x20" edc:por="00000000000000000000000000001101" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FF4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CIDR1" edc:mclr="00000000000000000000000010010000" edc:nzwidth="0x20" edc:por="00000000000000000000000010010000" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FF8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CIDR2" edc:mclr="00000000000000000000000000000101" edc:nzwidth="0x20" edc:por="00000000000000000000000000000101" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FFC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CIDR3" edc:mclr="00000000000000000000000010110001" edc:nzwidth="0x20" edc:por="00000000000000000000000010110001" ltx:memberofperipheral="ETM"/>
    </edc:SFRDataSector>
    <edc:ExternalSector edc:accessprotocol="qspi" edc:beginaddr="0x4000000" edc:endaddr="0x5000000" edc:isexecutable="true" edc:regionid="QSPI" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0xE000E000" edc:endaddr="0xE000F000" edc:regionid="SCS" edc:rw="rw"/>
    <edc:BootConfigSector edc:beginaddr="0x0" edc:endaddr="0x5E00" edc:regionid="BOOT_FLASH" edc:rw="rw"/>
    <edc:DeviceIDSector edc:beginaddr="0x41000018" edc:endaddr="0x4100001C" edc:mask="0xFFFF" edc:regionid="devid" edc:value="0x9B8F"/>
    <edc:RegisterMap edc:id="TC1/COUNT8">
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x4000182F" edc:cname="PERBUF" edc:mclr="11111111" edc:nzwidth="0x8" edc:por="11111111" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x40001830" edc:cname="CCBUF0" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Counter/Compare Buffer Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x40001831" edc:cname="CCBUF1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Counter/Compare Buffer Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x40001814" edc:cname="COUNT" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x4000181B" edc:cname="PER" edc:mclr="11111111" edc:nzwidth="0x8" edc:por="11111111" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x4000181C" edc:cname="CC0" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Counter/Compare Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x4000181D" edc:cname="CC1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Counter/Compare Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="TC0/COUNT8">
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x4000142F" edc:cname="PERBUF" edc:mclr="11111111" edc:nzwidth="0x8" edc:por="11111111" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x40001430" edc:cname="CCBUF0" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Counter/Compare Buffer Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x40001431" edc:cname="CCBUF1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Counter/Compare Buffer Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x40001414" edc:cname="COUNT" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
