Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:SFRDef edc:access="nn----nnnnnnnnnn" edc:addr="0x4201000A" edc:cname="INTENSET" edc:impl="0xC3FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="PER0" edc:desc="Periodic Interval 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER1" edc:desc="Periodic Interval 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER2" edc:desc="Periodic Interval 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER3" edc:desc="Periodic Interval 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER4" edc:desc="Periodic Interval 4 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER5" edc:desc="Periodic Interval 5 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER6" edc:desc="Periodic Interval 6 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER7" edc:desc="Periodic Interval 7 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:desc="Compare 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:desc="Compare 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:desc="Tamper Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nn----nnnnnnnnnn" edc:addr="0x4201000C" edc:cname="INTFLAG" edc:impl="0xC3FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="PER0" edc:desc="Periodic Interval 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER1" edc:desc="Periodic Interval 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER2" edc:desc="Periodic Interval 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER3" edc:desc="Periodic Interval 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER4" edc:desc="Periodic Interval 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER5" edc:desc="Periodic Interval 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER6" edc:desc="Periodic Interval 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER7" edc:desc="Periodic Interval 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:desc="Compare 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:desc="Compare 1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:desc="Tamper" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------rrrrr--------rr-rrrr" edc:addr="0x42010010" edc:cname="SYNCBUSY" edc:impl="0xF806F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable Bit Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREQCORR" edc:desc="FREQCORR Register Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="COUNT Register Busy" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP0" edc:desc="COMP 0 Register Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:desc="COMP 1 Register Busy" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="COUNTSYNC" edc:desc="Count Synchronization Enable Bit Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GP0" edc:desc="General Purpose 0 Register Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GP1" edc:desc="General Purpose 1 Register Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GP2" edc:desc="General Purpose 2 Register Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GP3" edc:desc="General Purpose 3 Register Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:addr="0x42010018" edc:cname="COUNT" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="TC3/COUNT32">
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:addr="0x40002020" edc:cname="CC1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Counter/Compare Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:addr="0x40002030" edc:cname="CCBUF0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Counter/Compare Buffer Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:addr="0x40002014" edc:cname="COUNT" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:addr="0x40002034" edc:cname="CCBUF1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Counter/Compare Buffer Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:addr="0x4000201C" edc:cname="CC0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Counter/Compare Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:EmulatorSector edc:beginaddr="0xE0001000" edc:endaddr="0xE000F000" edc:regionid="emulation"/>
  </edc:PhysicalSpace>
  <edc:FusesSpace>
    <edc:ConfigFuseSector edc:beginaddr="0x45F88" edc:endaddr="0x45FC0" edc:regionid="FUSES">
      <edc:DCRDef edc:_addr="0x45F88" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="FUSERID" edc:factorydefault="0x0000FFFF" edc:impl="0xFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="USER_ID" edc:desc="User unique ID, readable using the JTAG USER_ID instruction" edc:nzwidth="0x10"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
