Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/edc/PIC32CX1012BZ25048.PIC
      <edc:DCRDef edc:_addr="0x45F9C" edc:access="n-----------------------------n-" edc:cname="FBCFG0" edc:factorydefault="0x80000002" edc:impl="0x80000002" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="PCSCMODE" edc:desc="PCache Single cache Mode" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SINGLE" edc:desc="PCHE ICache Only.CPU Instructions (code, data) go to PCHE ONLY." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DUAL" edc:desc="PCHE ICache and DCache. CPU opcodes go to PCEHE ICache port and data goes to PCHE" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1D"/>
            <edc:DCRFieldDef edc:cname="BINFOVALID" edc:desc="BCFG info valid" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="NOT_VALID" edc:desc="BCFG0 to BCFG7 is not valid." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="VALID" edc:desc="BCFG0 to BCFG7 is valid." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:_addr="0x45FA0" edc:offset="0x1C"/>
      <edc:DCRDef edc:_addr="0x45FBC" edc:access="-------------------------------n" edc:cname="FCPN0" edc:factorydefault="0x10000000" edc:impl="0x1" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Boot Code Protect" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ENABLED" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:FusesSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PMU_BK_LX"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VPMU_VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PMU_MDLO_OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA00"/>
      <edc:VirtualPin edc:name="RPA0" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="15" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="15" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="15" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="7" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="7" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="7" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="QSPI_DATA2" edc:ppsfunction="QSPI" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="RTC_IN3" edc:ppsfunction="RTCC" ltx:memberofperipheral="RTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA01"/>
      <edc:VirtualPin edc:name="CMP1" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="RPA1" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="15" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="15" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="15" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="7" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="7" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="QSPI_DATA3" edc:ppsfunction="QSPI" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="RTC_IN2" edc:ppsfunction="RTCC" ltx:memberofperipheral="RTC"/>
      <edc:VirtualPin edc:name="RTC_OUT" edc:ppsfunction="RTCC" ltx:memberofperipheral="RTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA02"/>
      <edc:VirtualPin edc:name="CMP0" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="RPA2" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="15" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="15" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="8" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="8" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="8" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="RTC_IN1" edc:ppsfunction="RTCC" ltx:memberofperipheral="RTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA05"/>
      <edc:VirtualPin edc:name="RPA5" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="1" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="1" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="1" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="8" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="8" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="SERCOM0_PAD0" edc:ppsfunction="SERCOM0" ltx:memberofperipheral="SERCOM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA06"/>
      <edc:VirtualPin edc:name="CMP1" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="RPA6" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="1" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="1" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="9" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="9" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="9" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="SERCOM0_PAD1" edc:ppsfunction="SERCOM0" ltx:memberofperipheral="SERCOM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA07"/>
      <edc:VirtualPin edc:name="RPA7" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="TRCLK" ltx:memberofperipheral="TPI"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="2" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="2" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="2" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="9" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="9" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="9" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="SERCOM1_PAD0" edc:ppsfunction="SERCOM1" ltx:memberofperipheral="SERCOM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA08"/>
      <edc:VirtualPin edc:name="RPA8" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="14" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="14" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="2" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="2" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="2" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="9" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="9" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="9" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="SERCOM1_PAD1" edc:ppsfunction="SERCOM1" ltx:memberofperipheral="SERCOM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA09"/>
      <edc:VirtualPin edc:name="RPA9" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="15" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="15" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="15" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="2" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="2" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="2" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="9" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="9" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="RTC_IN0_ALT" edc:ppsfunction="RTCC" ltx:memberofperipheral="RTC"/>
      <edc:VirtualPin edc:name="SERCOM1_PAD2" edc:ppsfunction="SERCOM1" ltx:memberofperipheral="SERCOM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10"/>
      <edc:VirtualPin edc:name="RPA10" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="10" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="10" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="10" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="2" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="2" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="RTC_OUT_ALT" edc:ppsfunction="RTCC" ltx:memberofperipheral="RTC"/>
      <edc:VirtualPin edc:name="SERCOM1_PAD3" edc:ppsfunction="SERCOM1" ltx:memberofperipheral="SERCOM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12"/>
      <edc:VirtualPin edc:name="RPB12" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="14" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="14" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="14" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="7" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="7" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="7" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="QSPI_DATA0" edc:ppsfunction="QSPI" ltx:memberofperipheral="QSPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB13"/>
      <edc:VirtualPin edc:name="RPB13" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="14" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="14" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="14" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="7" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="7" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="7" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="QSPI_DATA1" edc:ppsfunction="QSPI" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="RTC_EVENT" edc:ppsfunction="RTCC" ltx:memberofperipheral="RTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13"/>
      <edc:VirtualPin edc:name="RPA13" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="10" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="10" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="3" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="3" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="3" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="SERCOM2_PAD0" edc:ppsfunction="SERCOM2" ltx:memberofperipheral="SERCOM2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14"/>
      <edc:VirtualPin edc:name="RPA14" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="11" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="11" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="11" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="3" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="3" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="SERCOM2_PAD1" edc:ppsfunction="SERCOM2" ltx:memberofperipheral="SERCOM2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="BUCK_CLDO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="EXT48K"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="BUCK_BB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="X0_N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="XO_P"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="BUCK_PLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="BUCK_LPA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="LPA_OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="MPA_OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="BUCK_MPA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NMCLR"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB00"/>
      <edc:VirtualPin edc:name="AIN2" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="AIN4" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="RPB0" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="11" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="11" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="11" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="4" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="4" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="4" ltx:memberofperipheral="EIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB01"/>
      <edc:VirtualPin edc:name="AIN3" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="AIN5" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="RPB1" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="11" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="11" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="11" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="4" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="4" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="4" ltx:memberofperipheral="EIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB02"/>
      <edc:VirtualPin edc:name="AIN0" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="AIN6" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="RPB2" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="11" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="11" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="4" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="4" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="4" ltx:memberofperipheral="EIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB03"/>
      <edc:VirtualPin edc:name="AIN1" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="AIN7" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="RPB3" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="12" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="12" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="12" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="4" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="4" ltx:memberofperipheral="EIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB04"/>
      <edc:VirtualPin edc:name="AIN0" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="INT0" ltx:memberofperipheral="PMU"/>
      <edc:VirtualPin edc:name="RPB4" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="TRD3" ltx:memberofperipheral="TPI"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="12" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="12" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="12" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="5" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="5" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="5" ltx:memberofperipheral="EIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB05"/>
      <edc:VirtualPin edc:name="AIN1" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="RPB5" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="TRD0" ltx:memberofperipheral="TPI"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="12" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="12" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="12" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="5" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="5" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="5" ltx:memberofperipheral="EIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB06"/>
      <edc:VirtualPin edc:name="AIN2" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="ANN0" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="RPB6" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="TRD1" ltx:memberofperipheral="TPI"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="12" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="12" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="5" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="5" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="5" ltx:memberofperipheral="EIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB07"/>
      <edc:VirtualPin edc:name="AIN3" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="RPB7" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="TRD2" ltx:memberofperipheral="TPI"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="13" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="13" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="13" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="5" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="5" ltx:memberofperipheral="EIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB09"/>
      <edc:VirtualPin edc:name="RPB9" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="13" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="13" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="13" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="28" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="6" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="6" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="6" ltx:memberofperipheral="EIC"/>
    </edc:Pin>
